In [11]:
import pandas
import numpy

unemp_county = pandas.read_csv("unemployment-by-county-us.csv")
unemp_county.head()

   Year     Month        State         County  Rate
0  2015  February  Mississippi  Newton County   6.1
1  2015  February  Mississippi  Panola County   9.4
2  2015  February  Mississippi  Monroe County   7.9
3  2015  February  Mississippi   Hinds County   6.1
4  2015  February  Mississippi  Kemper County  10.6

In [21]:
dataFrame = pandas.read_csv("us-minimum.zip", encoding='latin')

act_min_wage = pandas.DataFrame()

for name, group in dataFrame.groupby("State"):
    if act_min_wage.empty:
        act_min_wage = group.set_index("Year")[["Low.2018"]].rename(columns={"Low.2018":name})
    else:
        act_min_wage = act_min_wage.join(group.set_index("Year")[["Low.2018"]].rename(columns={"Low.2018":name}))

act_min_wage = act_min_wage.replace(0, numpy.NaN).dropna(axis=1)
act_min_wage.tail(6)

,Alaska,Arkansas,California,Colorado,Connecticut,Delaware,District of Columbia,Federal (FLSA),Guam,Hawaii,...,Pennsylvania,Puerto Rico,Rhode Island,South Dakota,Utah,Vermont,Washington,West Virginia,Wisconsin,Wyoming
Year,,,,,,,,,,,,,,,,,,,,,
2012,8.45,6.82,8.72,8.33,9.00,7.91,9.00,7.91,7.91,7.91,...,7.91,5.54,8.07,7.91,7.91,9.23,9.86,7.91,7.91,5.62
2013,8.33,6.72,8.60,8.36,8.87,7.79,8.87,7.79,7.79,7.79,...,7.79,5.46,8.33,7.79,7.79,9.24,9.88,7.79,7.79,5.54
2014,8.20,6.61,9.52,8.46,9.20,8.20,10.05,7.67,7.67,7.67,...,7.67,5.37,8.46,7.67,7.67,9.23,9.86,7.67,7.67,5.45
2015,9.24,7.92,9.51,8.69,9.67,8.72,11.09,7.66,8.72,8.19,...,7.66,5.37,9.51,8.98,7.66,9.67,10.00,8.45,7.66,5.44
2016,10.17,8.35,10.43,8.67,10.02,8.61,12.00,7.56,8.61,8.87,...,7.56,5.30,10.02,8.92,7.56,10.02,9.88,9.13,7.56,5.37
2017,10.01,8.68,10.22,9.50,10.32,8.43,11.75,7.41,8.43,9.45,...,7.41,5.19,9.81,8.84,7.41,10.22,11.24,8.94,7.41,5.26

In [19]:
def get_min_wage(year, state):
    try:
        return act_min_wage.loc[year][state]
    except:
        return numpy.NaN

get_min_wage(2012, "Colorado")

8.33

In [26]:
%%time

unemp_county['min_wage'] = list(map(get_min_wage, unemp_county['Year'], unemp_county['State']))

Wall time: 1min 43s

In [31]:
unemp_county[['Rate', 'min_wage']].corr()

              Rate  min_wage
Rate      1.000000  0.153047
min_wage  0.153047  1.000000

In [30]:
unemp_county[['Rate', 'min_wage']].cov()

              Rate  min_wage
Rate      9.687873  0.651586
min_wage  0.651586  1.874228

In [33]:
pres16 = pandas.read_csv("pres16results.csv")
pres16.head()

,county,fips,cand,st,pct_report,votes,total_votes,pct,lead
0,NaN,US,Donald Trump,US,0.9951,60350241.0,127592176.0,0.472993,Donald Trump
1,NaN,US,Hillary Clinton,US,0.9951,60981118.0,127592176.0,0.477938,Donald Trump
2,NaN,US,Gary Johnson,US,0.9951,4164589.0,127592176.0,0.032640,Donald Trump
3,NaN,US,Jill Stein,US,0.9951,1255968.0,127592176.0,0.009844,Donald Trump
4,NaN,US,Evan McMullin,US,0.9951,451636.0,127592176.0,0.003540,Donald Trump

In [35]:
len(unemp_county)

885548

In [36]:
county_2015 = unemp_county[(unemp_county['Year']==2015) & (unemp_county['Month']=='February')]

In [38]:
county_2015.head()

   Year     Month        State         County  Rate  min_wage
0  2015  February  Mississippi  Newton County   6.1       NaN
1  2015  February  Mississippi  Panola County   9.4       NaN
2  2015  February  Mississippi  Monroe County   7.9       NaN
3  2015  February  Mississippi   Hinds County   6.1       NaN
4  2015  February  Mississippi  Kemper County  10.6       NaN